<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download and package the latest version of Logitech G Hub.</string>
    <key>Identifier</key>
    <string>com.github.jrmfong.pkg.LogitechGHub</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Logitech G Hub</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.jrmfong.download.LogitechGHub</string>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict/>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict/>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Scripts</string>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/preinstall</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_content</key>
                <string>#!/bin/bash

readonly launch_daemons_path="$3/Library/LaunchDaemons/com.logi.ghub.updater.plist"
readonly launch_agent_path="$3/Library/LaunchDaemons/com.logi.ghub.plist"

# kill the pre-existing installer
/usr/bin/killall lghub_installer

# kill the launch daemon
/usr/bin/killall lghub_updater

# kill the launch agent
/usr/bin/killall lghub_system_tray
/usr/bin/killall lghub_agent

# unload the launchd plist only if installing on the boot volume
if [[ "$3" = "/" ]]; then
    /bin/launchctl bootout system "${launch_daemons_path}"
fi

/bin/rm -rf "${launch_daemons_path}" \
        "${launch_agent_path}" \
        "$3/Applications/lghub.app"

exit 0</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_content</key>
                <string>#!/bin/bash

readonly ghub_url="%DOWNLOAD_URL%"
readonly installer_file="lghub.zip"

cd /tmp

echo "$(date "+%Y-%m-%d %H:%M:%S") Download the installer now."

curl -s -o ${installer_file} "${ghub_url}"

if [[ -e ${installer_file} ]]; then
    echo "$(date "+%Y-%m-%d %H:%M:%S") Installer successfully downloaded. Proceed to unzip and install silently..."
    unzip ${installer_file}
    sudo ./lghub_installer.app/Contents/MacOS/lghub_installer --silent
    sleep 2
    rm -rf "${installer_file}" ./lghub_installer.app/ ./__MACOSX/
else
    echo "$(date "+%Y-%m-%d %H:%M:%S") Failed to download the installer. Exiting..."
    exit 1
fi

exit 0</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>com.logi.ghub</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>scripts</key>
                    <string>%RECIPE_CACHE_DIR%/Scripts/</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <string>%RECIPE_CACHE_DIR%/UNZIP</string>
                    <string>%RECIPE_CACHE_DIR%/Scripts</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
