<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of CueTimer and creates a package.</string>
        <key>Identifier</key>
        <string>com.github.jrmfong.pkg.ShureUpdateUtility</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Shure Update Utility</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.jrmfong.download.ShureUpdateUtility</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/pkg_unpack/</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/pkg_unpack/temp.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/pkg_payload/</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Versioner</string>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/pkg_payload/Applications/%NAME%.app/Contents/Info.plist</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%pathname%</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/pkg_unpack/</string>
                        <string>%RECIPE_CACHE_DIR%/pkg_payload/</string>
                    </array>
                </dict>
            </dict>
            
        </array>
    </dict>
</plist>