<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download and extract Shure Update Utility.</string>
        <key>Identifier</key>
        <string>com.github.jrmfong.download.ShureUpdateUtility</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Shure Update Utility</string>
            <key>DOWNLOAD_URL</key>
            <string>https://www.shure.com/en-US/sw/suu-mac</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                    <key>filename</key>
                    <string>%NAME%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%</string>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Shure Incorporated (4K6323CXC4)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                    <key>deep_verification</key>
                    <true/>
                    <key>strict_verification</key>
                    <true/>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
