<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Shure Designer 6 and creates a package.</string>
        <key>Identifier</key>
        <string>com.github.jrmfong.pkg.ShureDesigner6</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Shure Designer 6</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>ParentRecipe</key>
        <string>com.github.jrmfong.download.ShureDesigner6</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>PlistReader</string>
                <key>Arguments</key>
                <dict>
                    <key>info_path</key>
                    <string>%found_filename%/Contents/Info.plist</string>
                    <key>plist_keys</key>
                    <dict>
                        <key>CFBundleShortVersionString</key>
                        <string>version</string>
                        <key>CFBundleIdentifier</key>
                        <string>bundleid</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgdirs</key>
                    <dict>
                        <key>private</key>
                        <string>0777</string>
                        <key>private/tmp</key>
                        <string>0777</string>
                        <key>private/tmp/shuredesigner</key>
                        <string>0777</string>
                    </dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%pkgroot%/private/tmp/shuredesigner/Installer.app</string>
                    <key>overwrite</key>
                    <true/>
                    <key>source_path</key>
                    <string>%found_filename%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgdirs</key>
                    <dict/>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/scripts</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>file_content</key>
                    <string>#!/bin/zsh
# Install Shure Designer 6
"/private/tmp/shuredesigner/Installer.app/Contents/MacOS/installbuilder.sh" --mode unattended --unattendedmodeui none 
</string>
                    <key>file_mode</key>
                    <string>0755</string>
                    <key>file_path</key>
                    <string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>group</key>
                                <string>admin</string>
                                <key>mode</key>
                                <string>0777</string>
                                <key>path</key>
                                <string>private/tmp/shuredesigner/</string>
                                <key>user</key>
                                <string>root</string>
                            </dict>
                        </array>
                        <key>id</key>
                        <string>%bundleid%custom</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>pkgname</key>
                        <string>%NAME%-%version%</string>
                        <key>pkgroot</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                        <key>scripts</key>
                        <string>%RECIPE_CACHE_DIR%/scripts</string>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                        <string>%RECIPE_CACHE_DIR%/scripts</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
