<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Atlassian Loom and turns it into a package.</string>
    <key>Identifier</key>
    <string>com.github.jerefong.pkg.Loom</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Loom</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.jere.download.Loom</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%pathname%/*.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
