<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of CueTimer and creates a package.</string>
        <key>Identifier</key>
        <string>com.github.jrmfong.pkg.CueTimer</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>CueTimer</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>ParentRecipe</key>
        <string>com.github.jrmfong.download.CueTimer</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>AppPkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>app_path</key>
                    <string>%pathname%/*.app</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
