<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Ekahau Capture and turns it into a package.</string>
	<key>Identifier</key>
	<string>com.github.jrmfong.pkg.EkahauCapture</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Ekahau Capture</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jrmfong.download.EkahauCapture</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%pathname%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
