<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the current package of Ekahau Capture.</string>
	<key>Identifier</key>
	<string>com.github.jrmfong.download.EkahauCapture</string>
	<key>Input</key>
	<dict>
		<key>BASE_URL</key>
		<string>https://sw.ekahau.com/download/capture/</string>
		<key>NAME</key>
		<string>Ekahau Capture</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>https://sw.ekahau.com/download/capture/setup/EkahauCapture-[0-9.]+.dmg</string>
				<key>url</key>
				<string>%BASE_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>deep_verification</key>
				<true/>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>identifier "com.ekahau.capture" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "456L77HQ44"</string>
				<key>strict_verification</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
