<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the current package of Ekahau AI Pro.</string>
    <key>Identifier</key>
    <string>com.github.jrmfong.download.EkahauAIPro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Ekahau AI Pro</string>
        <key>BASE_URL</key>
        <string>https://sw.ekahau.com/download/pro/</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>url</key>
                <string>%BASE_URL%</string>
                <key>re_pattern</key>
                <string>https://sw.ekahau.com/download/pro/setup/EkahauAIPro-([0-9.]+).dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://sw.ekahau.com/download/pro/setup/EkahauAIPro-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>requirement</key>
                <string>identifier "com.ekahau.wifidesign.ess" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "456L77HQ44"</string>
                <key>input_path</key>
                <string>%pathname%/*.app</string>
                <key>deep_verification</key>
                <true/>
                <key>strict_verification</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>
